; domain
(define (domain scanalyzer3d_52-domain)
 (:requirements :strips :typing :action-costs)
 (:types segment car)
 (:predicates (on ?c - car ?s - segment) (analyzed ?c - car) (cycle_2 ?s1 - segment ?s2 - segment) (cycle_4 ?s1 - segment ?s2 - segment ?s3 - segment ?s4 - segment) (cycle_2_with_analysis ?s1 - segment ?s2 - segment) (cycle_4_with_analysis ?s1 - segment ?s2 - segment ?s3 - segment ?s4 - segment))
 (:functions (total-cost))
 (:action analyze_2
  :parameters ( ?s1 - segment ?s2 - segment ?c1 - car ?c2 - car)
  :precondition (and (cycle_2_with_analysis ?s1 ?s2) (on ?c1 ?s1) (on ?c2 ?s2))
  :effect (and (not (on ?c1 ?s1)) (not (on ?c2 ?s2)) (on ?c1 ?s2) (on ?c2 ?s1) (analyzed ?c1) (increase (total-cost) 3)))
 (:action analyze_4
  :parameters ( ?s1 - segment ?s2 - segment ?s3 - segment ?s4 - segment ?c1 - car ?c2 - car ?c3 - car ?c4 - car)
  :precondition (and (cycle_4_with_analysis ?s1 ?s2 ?s3 ?s4) (on ?c1 ?s1) (on ?c2 ?s2) (on ?c3 ?s3) (on ?c4 ?s4))
  :effect (and (not (on ?c1 ?s1)) (not (on ?c2 ?s2)) (not (on ?c3 ?s3)) (not (on ?c4 ?s4)) (on ?c1 ?s4) (on ?c2 ?s1) (on ?c3 ?s2) (on ?c4 ?s3) (analyzed ?c1) (increase (total-cost) 3)))
 (:action rotate_2
  :parameters ( ?s1 - segment ?s2 - segment ?c1 - car ?c2 - car)
  :precondition (and (cycle_2 ?s1 ?s2) (on ?c1 ?s1) (on ?c2 ?s2))
  :effect (and (not (on ?c1 ?s1)) (not (on ?c2 ?s2)) (on ?c1 ?s2) (on ?c2 ?s1) (increase (total-cost) 1)))
 (:action rotate_4
  :parameters ( ?s1 - segment ?s2 - segment ?s3 - segment ?s4 - segment ?c1 - car ?c2 - car ?c3 - car ?c4 - car)
  :precondition (and (cycle_4 ?s1 ?s2 ?s3 ?s4) (on ?c1 ?s1) (on ?c2 ?s2) (on ?c3 ?s3) (on ?c4 ?s4))
  :effect (and (not (on ?c1 ?s1)) (not (on ?c2 ?s2)) (not (on ?c3 ?s3)) (not (on ?c4 ?s4)) (on ?c1 ?s4) (on ?c2 ?s1) (on ?c3 ?s2) (on ?c4 ?s3) (increase (total-cost) 1)))
)

; problem
(define (problem scanalyzer3d_52-problem)
 (:domain scanalyzer3d_52-domain)
 (:objects
   seg_in_1a seg_in_1b seg_out_1a seg_out_1b - segment
   car_in_1a car_in_1b car_out_1a car_out_1b - car
 )
 (:init (cycle_4 seg_in_1a seg_in_1b seg_out_1a seg_out_1b) (cycle_4_with_analysis seg_in_1a seg_in_1b seg_out_1a seg_out_1b) (on car_in_1a seg_in_1a) (on car_in_1b seg_in_1b) (on car_out_1a seg_out_1a) (on car_out_1b seg_out_1b) (= (total-cost) 0))
 (:goal (and (analyzed car_in_1a) (analyzed car_in_1b) (analyzed car_out_1a) (analyzed car_out_1b) (on car_in_1a seg_out_1b) (on car_in_1b seg_in_1a) (on car_out_1a seg_in_1b) (on car_out_1b seg_out_1a)))
 (:metric minimize (total-cost))
)

; plan
1. (analyze_4 seg_in_1a seg_in_1b seg_out_1a seg_out_1b car_in_1a car_in_1b car_out_1a car_out_1b)
   deleted: (on car_in_1a seg_in_1a) (on car_in_1b seg_in_1b) (on car_out_1a seg_out_1a) (on car_out_1b seg_out_1b)
   added: (on car_in_1a seg_out_1b) (on car_in_1b seg_in_1a) (on car_out_1a seg_in_1b) (on car_out_1b seg_out_1a) (analyzed car_in_1a)
   goals met: 5 of 8
2. (analyze_4 seg_in_1a seg_in_1b seg_out_1a seg_out_1b car_in_1b car_out_1a car_out_1b car_in_1a)
   deleted: (on car_in_1b seg_in_1a) (on car_out_1a seg_in_1b) (on car_out_1b seg_out_1a) (on car_in_1a seg_out_1b)
   added: (on car_in_1b seg_out_1b) (on car_out_1a seg_in_1a) (on car_out_1b seg_in_1b) (on car_in_1a seg_out_1a) (analyzed car_in_1b)
   goals met: 2 of 8
3. (analyze_4 seg_in_1a seg_in_1b seg_out_1a seg_out_1b car_out_1a car_out_1b car_in_1a car_in_1b)
   deleted: (on car_out_1a seg_in_1a) (on car_out_1b seg_in_1b) (on car_in_1a seg_out_1a) (on car_in_1b seg_out_1b)
   added: (on car_out_1a seg_out_1b) (on car_out_1b seg_in_1a) (on car_in_1a seg_in_1b) (on car_in_1b seg_out_1a) (analyzed car_out_1a)
   goals met: 3 of 8
4. (analyze_4 seg_in_1a seg_in_1b seg_out_1a seg_out_1b car_out_1b car_in_1a car_in_1b car_out_1a)
   deleted: (on car_out_1b seg_in_1a) (on car_in_1a seg_in_1b) (on car_in_1b seg_out_1a) (on car_out_1a seg_out_1b)
   added: (on car_out_1b seg_out_1b) (on car_in_1a seg_in_1a) (on car_in_1b seg_in_1b) (on car_out_1a seg_out_1a) (analyzed car_out_1b)
   goals met: 4 of 8
5. (analyze_4 seg_in_1a seg_in_1b seg_out_1a seg_out_1b car_in_1a car_in_1b car_out_1a car_out_1b)
   deleted: (on car_in_1a seg_in_1a) (on car_in_1b seg_in_1b) (on car_out_1a seg_out_1a) (on car_out_1b seg_out_1b)
   added: (on car_in_1a seg_out_1b) (on car_in_1b seg_in_1a) (on car_out_1a seg_in_1b) (on car_out_1b seg_out_1a)
   goals met: 8 of 8
